[{"Id":1,"Text":"A company can extend a private cloud by addig its own physical servers to the public cloud","TextSecond":"","Options":["Yes","No"],"CorectOption":[1],"Type":0},{"Id":2,"Text":"To build a hybrid cloud, you must deploy resources to the public cloud","TextSecond":"","Options":["Yes","No"],"CorectOption":[0],"Type":0},{"Id":3,"Text":"A private cloud must be disconnected from the internet","TextSecond":"","Options":["Yes","No"],"CorectOption":[1],"Type":0},{"Id":4,"Text":"A platform as a Service (PaaS) solution that hosts web apps in Azure provides full control of the operating systems that host applications","TextSecond":"","Options":["Yes","No"],"CorectOption":[1],"Type":0},{"Id":5,"Text":"A platform as a Service (PaaS) soulution that hosts web apps in Azure can be provided with additional memory by changing the pricing tier","TextSecond":"","Options":["Yes","No"],"CorectOption":[0],"Type":0},{"Id":6,"Text":"A platform as a Service (PaaS) soulution that hosts web apps in Azure can be configured to automatically scale the number of instances based on demand","TextSecond":"","Options":["Yes","No"],"CorectOption":[0],"Type":0},{"Id":7,"Text":"Your company plans to migrate all its data and resources to Azure.The company's migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure.You need to deploy an Azure environment that meets the company migration plan.\n    Solution: You create Azure virtual machines, Azure SQL databases, and Azure Storage accounts.\n    Does this meet the goal?","TextSecond":"","Options":["Yes","No"],"CorectOption":[1],"Type":0},{"Id":8,"Text":"Building a data center infrastructure is an exemple of operational expediture (OpEx) costs","TextSecond":"","Options":["Yes","No"],"CorectOption":[1],"Type":0},{"Id":9,"Text":"Monthly salaries for technical personnel are an exemple of operational expenditure (OpEx) costs","TextSecond":"","Options":["Yes","No"],"CorectOption":[0],"Type":0},{"Id":10,"Text":"Leasing software is an exemple of operational expediture (OpEx) costs","TextSecond":"","Options":["Yes","No"],"CorectOption":[0],"Type":0},{"Id":11,"Text":"With Software as a Service(SaaS), you must apply software updates","TextSecond":"","Options":["Yes","No"],"CorectOption":[1],"Type":0},{"Id":12,"Text":"With Infrastructure as a Service (IaaS), you must install the software that you want to use","TextSecond":"","Options":["Yes","No"],"CorectOption":[0],"Type":0},{"Id":13,"Text":"Azure Backup is an exemple of platform as a Service(PaaS)","TextSecond":"","Options":["Yes","No"],"CorectOption":[0],"Type":0},{"Id":14,"Text":"You can create a resource group inside of another resource group","TextSecond":"","Options":["Yes","No"],"CorectOption":[1],"Type":0},{"Id":15,"Text":"An Azure virtual machine can be in multiple resource groups","TextSecond":"","Options":["Yes","No"],"CorectOption":[1],"Type":0},{"Id":16,"Text":"A resource group can contain resources from multiple Azure regions.","TextSecond":"","Options":["Yes","No"],"CorectOption":[0],"Type":0},{"Id":17,"Text":"Microsoft SQL Server 2019 installen on an Azure virtual machine is an exemple of platform as a Service(PaaS)","TextSecond":"","Options":["Yes","No"],"CorectOption":[1],"Type":0},{"Id":18,"Text":"Azure SQL Database is an exemple of platform as a Service (PaaS)","TextSecond":"","Options":["Yes","No"],"CorectOption":[0],"Type":0},{"Id":19,"Text":"Azure Cosmos DB is an exemple of software as a Service (SaaS)","TextSecond":"","Options":["Yes","No"],"CorectOption":[1],"Type":0},{"Id":20,"Text":"Azure Files is an exemple of infrastructure as a Service (IaaS)","TextSecond":"","Options":["Yes","No"],"CorectOption":[0],"Type":0},{"Id":21,"Text":"A DNS server that runs on an Azure virtual machine is an exemple of a platform as a Service(PaaS)","TextSecond":"","Options":["Yes","No"],"CorectOption":[0],"Type":0},{"Id":22,"Text":"Microsoft Intune is an exempple of software as a Service(SaaS)","TextSecond":"","Options":["Yes","No"],"CorectOption":[0],"Type":0},{"Id":23,"Text":"Your company is planning to migrate all their virtual machines to an Azure pay-as-you-go subscription. The virtual machines are currently hosted on the Hyper-V hosts in a data center.\n    You are required make sure that the intended Azure solution uses the correct expenditure model.\n    Solution: You should recommend the use of the scalable expenditure model.\n    Does the solution meet the goal?","TextSecond":"","Options":["Yes","No"],"CorectOption":[1],"Type":0},{"Id":24,"Text":"You are required to deploy an Artificial Intelligence (AI) solution in Azure.\n    You want to make sure that you are able to build, test, and deploy predictive analytics for the solution.\n    Solution: You should make use of Azure Cosmos DB.\n    Does the solution meet the goal?","TextSecond":"","Options":["Yes","No"],"CorectOption":[1],"Type":0},{"Id":25,"Text":"You have 50 virtual machines hosted on-premises and 50 virtual machines hosted in Azure. The on-premises virtual machines and the Azure virtual machines connect to each other.\n    Which type of cloud model is this?","TextSecond":"","Options":["Hybrid","Private","Public"],"CorectOption":[0],"Type":0},{"Id":26,"Text":"Your company plans to deploy several custom applications to Azure. The applications will provide invoicing services to the customers of the company. Each application will have several prerequisite applications and services installed.\n    You need to recommend a cloud deployment solution for all the applications.\n    What should you recommend?","TextSecond":"","Options":["Software as a Service (SaaS)","Platform as a Service (PaaS)","Infrastructure as a Service (IaaS)"],"CorectOption":[2],"Type":0},{"Id":27,"Text":"Your company plans to migrate all its data and resources to Azure.\n    The company's migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure.\n    You need to deploy an Azure environment that meets the company's migration plan.\n    What should you create?","TextSecond":"","Options":["Azure virtual machines, Azure SQL databases, and Azure Storage accounts.","an Azure App Service and Azure virtual machines that have Microsoft SQL Server installed.","an Azure App Service and Azure SQL databases.","Azure storage accounts and web server in Azure virtual machines."],"CorectOption":[2],"Type":0},{"Id":28,"Text":"What does a customer provide in a software as a Service (SaaS) model?","TextSecond":"","Options":["application data","data storage","compute resources","application software"],"CorectOption":[0],"Type":0},{"Id":29,"Text":"Your company has virtual machines (VMs) hosted in Microsoft Azure. The VMs are located in a single Azure virtual network named VNet1.\n    The company has users that work remotely. The remote workers require access to the VMs on VNet1.\n    You need to provide access for the remote workers.\n    What should you do?","TextSecond":"","Options":["Configure a Site-to-Site (S2S) VPN.","Configure a VNet-toVNet VPN.","Configure a Point-to-Site (P2S) VPN.","Configure DirectAccess on a Windows Server 2012 server VM.","Configure a Multi-Site VPN"],"CorectOption":[2],"Type":0},{"Id":30,"Text":"You have an on-premises network that contains several servers.\n    You plan to migrate all the servers to Azure.\n    You need to recommend a solution to ensure that some of the servers are available if a single Azure data center goes offline for an extended period.\n    What should you include in the recommendation?","TextSecond":"","Options":["fault tolerance","elasticity","scalability","low latency"],"CorectOption":[0],"Type":0},{"Id":31,"Text":"Your company hosts an accounting application named App1 that is used by all the customers of the company.\n    App1 has low usage during the first three weeks of each month and very high usage during the last week of each month.\n    Which benefit of Azure Cloud Services supports cost management for this type of usage pattern?","TextSecond":"","Options":["high availability","elasticity","high latency","load balancing"],"CorectOption":[1],"Type":0},{"Id":32,"Text":"You plan to migrate a web application to Azure. The web application is accessed by external users.\n    You need to recommend a cloud deployment solution to minimize the amount of administrative effort used to manage the web application.\n    What should you include in the recommendation?","TextSecond":"","Options":["Software as a Service (SaaS)","Platform as a Service (PaaS)","Infrastructure as a Service (IaaS)","Database as a Service (DaaS)"],"CorectOption":[1],"Type":0},{"Id":33,"Text":"You have an on-premises network that contains 100 servers.\n    You need to recommend a solution that provides additional resources to your users. The solution must minimize capital and operational expenditure costs.\n    What should you include in the recommendation?","TextSecond":"","Options":["a complete migration to the public cloud","an additional data center","a private cloud","a hybrid cloud"],"CorectOption":[3],"Type":0},{"Id":34,"Text":"You plan to migrate several servers from an on-premises network to Azure.\n    What is an advantage of using a public cloud service for the servers over an on-premises network?","TextSecond":"","Options":["The public cloud is owned by the public, NOT a private corporation","The public cloud is a crowd-sourcing solution that provides corporations with the ability to enhance the cloud","All public cloud resources can be freely accessed by every member of the public","The public cloud is a shared entity whereby multiple corporations each use a portion of the resources in the cloud"],"CorectOption":[3],"Type":0},{"Id":35,"Text":"In which type of cloud model are all the hardware resources owned by a third-party and shared between multiple tenants?","TextSecond":"","Options":["private","hybrid","public"],"CorectOption":[2],"Type":0},{"Id":36,"Text":"Azure Cosmos DB is an exemple of a","TextSecond":"offering","Options":["Infrastructure as a Service (IaaS)","Platform as a Service (PaaS)","serverless","Software as a Service(SaaS)"],"CorectOption":[0],"Type":0},{"Id":37,"Text":"A Microsoft SQL Server database that is hosted in the cloud and has software updates managed by Azure is an exemple of","TextSecond":"","Options":["disaster recovery as a Service(DRaaS)","Platform as a Service (PaaS)","Infrastructure as a Service (IaaS)","Software as a Service(SaaS)"],"CorectOption":[1],"Type":0},{"Id":38,"Text":"When you are implementing a Software as a Service (SaaS) solution, you are responsible for","TextSecond":"","Options":["configuring high availability","defining scalability rules","installing the SaaS solution","configuring the SaaS solution"],"CorectOption":[3],"Type":0},{"Id":39,"Text":"An organisation that hosts its infrastructure","TextSecond":"no longer requires a data center","Options":["in a private cloud","in a hybrid cloud","in the public cloud","on a Hyper-V host"],"CorectOption":[2],"Type":0},{"Id":40,"Text":"When planning to migrate a public website to Azure, you must plan to","TextSecond":"no longer requires a data center","Options":["deploy a VPN.","pay monthly usage costs.","pay to transfer all the website data to Azure.","reduce the number of connection to the website"],"CorectOption":[1],"Type":0},{"Id":41,"Text":"Azure virtual machines:","TextSecond":"","Options":["Infrastructure as a Service (IaaS)","Platform as a Service(PaaS)","Software as a Service(SaaS)"],"CorectOption":[1],"Type":0},{"Id":42,"Text":"Azure Site Recovery provides","TextSecond":"for virtual machines.","Options":["fault tolerance","disaster recovery","elasticity","high availability"],"CorectOption":[0],"Type":0},{"Id":43,"Text":"","TextSecond":"is a desktop and application virtualization service that enables the use of a cloud-hosted version of Windows from any location","Options":["An availability set","Azure Spot Virtual Machines","Azure Virtual Desktop","Azure Virtual Machine Scale Sets"],"CorectOption":[2],"Type":0},{"Id":44,"Text":"What are two characteristics of the public cloud? Each correct answer presents a complete solution.\n      NOTE: Each correct selection is worth one point.","TextSecond":"","Options":["dedicated hardware","unsecured connections","limited storage","metered pricing","self-service management"],"CorectOption":[3,4],"Type":0}]